Podkova/src/Enums/НазначенияШаблоновЭтикетокИЦенников/НазначенияШаблоновЭтикетокИЦенников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НазначенияШаблоновЭтикетокИЦенников</name>
  <enumValues>
    <name>ЭтикеткаДляТоваров</name>
  </enumValues>
  <enumValues>
    <name>ЦенникДляТоваров</name>
  </enumValues>
  <enumValues>
    <name>ЭтикеткаДляСкладскихЯчеек</name>
  </enumValues>
  <enumValues>
    <name>ЭтикеткаДляДоставки</name>
  </enumValues>
  <enumValues>
    <name>ЭтикеткаСерииНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ЭтикеткаУпаковочныхЛистов</name>
  </enumValues>
  <enumValues>
    <name>ЭтикеткаДляАкцизныхМарок</name>
  </enumValues>
  <enumValues>
    <name>ЭтикеткаДляШтрихкодовУпаковок</name>
  </enumValues>
  <enumValues>
    <name>ЭтикеткаОбъектаЭксплуатации</name>
  </enumValues>
  <enumValues>
    <name>ЭтикеткаКодМаркировкиИСМП</name>
  </enumValues>
</mdclass:Enum>

Podkova/src/Enums/НазначенияШаблоновЭтикетокИЦенников/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора.Добавить(Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаДляТоваров);
	ДанныеВыбора.Добавить(Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЦенникДляТоваров);
	ДанныеВыбора.Добавить(Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаДляСкладскихЯчеек);
	ДанныеВыбора.Добавить(Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаДляДоставки);
	ДанныеВыбора.Добавить(Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаСерииНоменклатуры);
	ДанныеВыбора.Добавить(Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаУпаковочныхЛистов);
	ДанныеВыбора.Добавить(Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаДляАкцизныхМарок);
	ДанныеВыбора.Добавить(Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаДляШтрихкодовУпаковок);
	
КонецПроцедуры

#КонецОбласти
